Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue Class
 Analysis model issue (error, warning, information)
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelIssue
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisModelIssue
Public Class AnalysisModelIssue
The AnalysisModelIssue type exposes the following members.
Constructors
Name | Description
AnalysisModelIssue
Initializes a new instance of the AnalysisModelIssue class
Top
Properties
Name | Description
AnalysisObjects
 Gets or sets the analysis objects of the issue
Description
 Gets or sets the description of the issue, translated to the current language
Details
 Gets or sets the details of the issue, translated to the current language
ModelObjects
 Gets or sets the model objects of the issue
Positions
 Gets or sets the positions of the issue
Severity
 Gets or sets the issue severity
Type
 Gets or sets the issue type
Top
See Also
Reference
Tekla.Structures.Analysis Namespace